src/Catalogs/ГруппыСчетчиков/ГруппыСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыСчетчиков</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПолныйКодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>620</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУстановитьПометкуУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольПоступленияДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеВремяОтсутствияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ГруппыСчетчиков/Forms/ФормаВыбораДляДиаграммаОбщая/Module.bsl
#Область ОбработчикиСобыитийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИнициализироватьКомпоновщик();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьКомпоновщик()
    
    Поля = Новый Массив;
    Поля.Добавить("Ссылка");
    Поля.Добавить("Родитель");
    Поля.Добавить("Код");
    Поля.Добавить("ПолныйКодДляПоиска");
    Поля.Добавить("РазрешитьУстановитьПометкуУдаления");
    Поля.Добавить("КодДляПоиска");
    Поля.Добавить("КонтрольПоступленияДанных");
    Поля.Добавить("ДопустимоеВремяОтсутствияДанных");
    Поля.Добавить("Предопределенный");
    Поля.Добавить("ИмяПредопределенныхДанных");
    Список.УстановитьОграниченияИспользованияВОтборе(Поля);
     
КонецПроцедуры

#КонецОбласти
